saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/NXP.LPC54S018_DFP.11.0.0.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="usart_dma" Cversion="2.0.1" condition="device.LPC54S018_AND_driver.flexcomm_AND_driver.flexcomm_usart_AND_driver.lpc_dma">
      <description>USART Driver</description>
      <files>
        <file category="header" name="drivers/fsl_usart_dma.h"/>
        <file category="sourceC" name="drivers/fsl_usart_dma.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="usart" Cversion="2.0.3" condition="device.LPC54S018_AND_driver.flexcomm">
      <description>USART Driver</description>
      <files>
        <file category="header" name="drivers/fsl_usart.h"/>
        <file category="sourceC" name="drivers/fsl_usart.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="sha" Cversion="2.0.0" condition="device.LPC54S018_AND_driver.common">
      <description>SHA Driver</description>
      <files>
        <file category="header" name="drivers/fsl_sha.h"/>
        <file category="sourceC" name="drivers/fsl_sha.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="aes" Cversion="2.0.1" condition="device.LPC54S018_AND_driver.common">
      <description>AES Driver</description>
      <files>
        <file category="header" name="drivers/fsl_aes.h"/>
        <file category="sourceC" name="drivers/fsl_aes.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="common" Cversion="2.0.1" condition="device.LPC54S018_AND_device.LPC54S018_CMSIS_AND_driver.clock_AND_driver.reset">
      <description>COMMON Driver</description>
      <files>
        <file category="header" name="drivers/fsl_common.h"/>
        <file category="sourceC" name="drivers/fsl_common.c"/>
      </files>
    </component>
    <component Cclass="Board Support" Cgroup="SDK Project Template" Csub="project_template" Cvariant="LPC54S018" Cversion="1.0.0" condition="device.LPC54S018_AND_component.serial_manager_uart_AND_component.usart_adapter_AND_device.LPC54S018_startup_AND_driver.clock_AND_driver.common_AND_driver.emc_AND_driver.flexcomm_AND_driver.flexcomm_usart_AND_driver.lpc_gpio_AND_driver.lpc_iocon_AND_driver.power_AND_driver.reset_AND_utility.debug_console" isDefaultVariant="1">
      <description/>
      <files>
        <file category="header" attr="config" name="project_template/board.h"/>
        <file category="sourceC" attr="config" name="project_template/board.c"/>
        <file category="header" attr="config" name="project_template/clock_config.h"/>
        <file category="sourceC" attr="config" name="project_template/clock_config.c"/>
        <file category="header" attr="config" name="project_template/pin_mux.h"/>
        <file category="sourceC" attr="config" name="project_template/pin_mux.c"/>
        <file category="header" attr="config" name="project_template/peripherals.h"/>
        <file category="sourceC" attr="config" name="project_template/peripherals.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Csub="LPC54S018_startup" Cversion="1.0.0" condition="device.LPC54S018_AND_CMSIS_Include_core_cm4">
      <description/>
      <files>
        <file condition="iar" category="sourceAsm" attr="config" name="iar/startup_LPC54S018.s"/>
        <file condition="mdk" category="sourceAsm" attr="config" name="arm/startup_LPC54S018.s"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/LPC54S018_ram.scf"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/LPC54S018_spifi_flash.scf"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/LPC54S018_ram.icf"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/LPC54S018_spifi_flash.icf"/>
        <file category="header" attr="config" name="fsl_device_registers.h"/>
        <file category="header" attr="config" name="LPC54S018.h"/>
        <file category="header" attr="config" name="LPC54S018_features.h"/>
        <file category="sourceC" attr="config" name="system_LPC54S018.c"/>
        <file category="header" attr="config" name="system_LPC54S018.h"/>
      </files>
    </component>
  </components>
</package>
